cmsis-svd/cmsis-svd/data/Nuvoton/NANO100BN_v1.svd
       <register>
          <name>PA_H_MFP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PA_H_MFP</displayName>
          <description>Port A high byte  multiple function control register</description>
          <addressOffset>0x34</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA8_MFP</name>
              <description>PA.8 Pin Function Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_MFP</name>
              <description>PA.9 Pin Function Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_MFP</name>
              <description>PA.10 Pin Function Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_MFP</name>
              <description>PA.11 Pin Function Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA12_MFP</name>
              <description>PA.12 Pin Function Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA13_MFP</name>
              <description>PA.13 Pin Function Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA14_MFP</name>
              <description>PA.14 Pin Function Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA15_MFP</name>
              <description>PA.15 Pin Function Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PB_L_MFP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PB_L_MFP</displayName>
          <description>Port B low byte multiple function control register</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PB0_MFP</name>
              <description>PB.0 Pin Function Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_MFP</name>
              <description>PB.1 Pin Function Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_MFP</name>
              <description>PB.2 Pin Function Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_MFP</name>
              <description>PB.3 Pin Function Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_MFP</name>
              <description>PB.4 Pin Function Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_MFP</name>
              <description>PB.5 Pin Function Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_MFP</name>
              <description>PB.6 Pin Function Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_MFP</name>
              <description>PB.7 Pin Function Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PB_H_MFP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PB_H_MFP</displayName>
          <description>Port B high byte multiple function control register</description>
          <addressOffset>0x3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PB8_MFP</name>
              <description>PB.8 Pin Function Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9_MFP</name>
              <description>PB.9 Pin Function Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10_MFP</name>
              <description>PB.10 Pin Function Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB11_MFP</name>
              <description>PB.11 Pin Function Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_MFP</name>
              <description>PB.12 Pin Function Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_MFP</name>
              <description>PB.13 Pin Function Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_MFP</name>
              <description>PB.14 Pin Function Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_MFP</name>
              <description>PB.15 Pin Function Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PC_L_MFP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PC_L_MFP</displayName>
          <description>Port C low byte multiple function control register</description>
          <addressOffset>0x40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC0_MFP</name>
              <description>PC.0 Pin Function Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC1_MFP</name>
              <description>PC.1 Pin Function Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC2_MFP</name>
              <description>PC.2 Pin Function Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC3_MFP</name>
              <description>PC.3 Pin Function Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC4_MFP</name>
              <description>PC.4 Pin Function Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC5_MFP</name>
              <description>PC.5 Pin Function Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC6_MFP</name>
              <description>PC.6 Pin Function Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC7_MFP</name>
              <description>PC.7 Pin Function Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PC_H_MFP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PC_H_MFP</displayName>
          <description>Port C high byte multiple function control register</description>
          <addressOffset>0x44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC8_MFP</name>
              <description>PC.8 Pin Function Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC9_MFP</name>
              <description>PC.9 Pin Function Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC10_MFP</name>
              <description>PC.10 Pin Function Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC11_MFP</name>
              <description>PC.11 Pin Function Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC12_MFP</name>
              <description>PC.12 Pin Function Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC13_MFP</name>
              <description>PC.13 Pin Function Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC14_MFP</name>
              <description>PC.14 Pin Function Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PC15_MFP</name>
              <description>PC.15 Pin Function Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PD_L_MFP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PD_L_MFP</displayName>
          <description>Port D low byte multiple function control register</description>
          <addressOffset>0x48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD0_MFP</name>
              <description>PD.0 Pin Function Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD1_MFP</name>
              <description>PD.1 Pin Function Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD2_MFP</name>
              <description>PD.2 Pin Function Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD3_MFP</name>
              <description>PD.3 Pin Function Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD4_MFP</name>
              <description>PD.4 Pin Function Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD5_MFP</name>
              <description>PD.5 Pin Function Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD6_MFP</name>
              <description>PD.6 Pin Function Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD7_MFP</name>
              <description>PD.7 Pin Function Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PD_H_MFP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PD_H_MFP</displayName>
          <description>Port D high byte multiple function control register</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD8_MFP</name>
              <description>PD.8 Pin Function Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD9_MFP</name>
              <description>PD.9 Pin Function Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD10_MFP</name>
              <description>PD.10 Pin Function Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD11_MFP</name>
              <description>PD.11 Pin Function Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD12_MFP</name>
              <description>PD.12 Pin Function Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD13_MFP</name>
              <description>PD.13 Pin Function Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD14_MFP</name>
              <description>PD.14 Pin Function Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD15_MFP</name>
              <description>PD.15 Pin Function Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>PE_L_MFP</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>PE_L_MFP</displayName>
          <description>Port E low byte multiple function control register</description>
          <addressOffset>0x50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PE0_MFP</name>
              <description>PE.0 Pin Function Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE1_MFP</name>
              <description>PE.1 Pin Function Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE2_MFP</name>
              <description>PE.2 Pin Function Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE3_MFP</name>
              <description>PE.3 Pin Function Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE4_MFP</name>
              <description>PE.4 Pin Function Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE5_MFP</name>
              <description>PE.5 Pin Function Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE6_MFP</name>
              <description>PE.6 Pin Function Selection\nAt LQFP-128 Package:\nGPIOE[6]\nAt LQFP-64 Package:\nGPIOE[6]\nAt LQFP-48 Package:\nGPIOE[6]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE7_MFP</name>
              <description>PE.7 Pin Function Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
