cmsis-svd/cmsis-svd/data/Nuvoton/NANO100BN_v1.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>ADC Register Map</description>
      <groupName>ADC</groupName>
      <baseAddress>0x400E0000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>ADC_RESULT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>ADC_RESULT0</displayName>
          <description>A/D Data Register 0</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSLT</name>
              <description>A/D Conversion Result\nThis field contains 12 bits conversion results.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Data Valid Flag\nIt is a mirror of VALID bit in ADC_RESULTx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Over Run Flag\nIt is a mirror to OVERRUN bit in ADC_RESULTx</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserve</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT1</name>
          <displayName>ADC_RESULT1</displayName>
          <description>A/D Data Register 1</description>
          <addressOffset>0x4</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT2</name>
          <displayName>ADC_RESULT2</displayName>
          <description>A/D Data Register 2</description>
          <addressOffset>0x8</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT3</name>
          <displayName>ADC_RESULT3</displayName>
          <description>A/D Data Register 3</description>
          <addressOffset>0xC</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT4</name>
          <displayName>ADC_RESULT4</displayName>
          <description>A/D Data Register 4</description>
          <addressOffset>0x10</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT5</name>
          <displayName>ADC_RESULT5</displayName>
          <description>A/D Data Register 5</description>
          <addressOffset>0x14</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT6</name>
          <displayName>ADC_RESULT6</displayName>
          <description>A/D Data Register 6</description>
          <addressOffset>0x18</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT7</name>
          <displayName>ADC_RESULT7</displayName>
          <description>A/D Data Register 7</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT8</name>
          <displayName>ADC_RESULT8</displayName>
          <description>A/D Data Register 8</description>
          <addressOffset>0x20</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT9</name>
          <displayName>ADC_RESULT9</displayName>
          <description>A/D Data Register 9</description>
          <addressOffset>0x24</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT10</name>
          <displayName>ADC_RESULT10</displayName>
          <description>A/D Data Register 10</description>
          <addressOffset>0x28</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT11</name>
          <displayName>ADC_RESULT11</displayName>
          <description>A/D Data Register 11</description>
          <addressOffset>0x2C</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT12</name>
          <displayName>ADC_RESULT12</displayName>
          <description>A/D Data Register 12</description>
          <addressOffset>0x30</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT13</name>
          <displayName>ADC_RESULT13</displayName>
          <description>A/D Data Register 13</description>
          <addressOffset>0x34</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT14</name>
          <displayName>ADC_RESULT14</displayName>
          <description>A/D Data Register 14</description>
          <addressOffset>0x38</addressOffset>
       </register>
       <register derivedFrom="ADC_RESULT0">
          <name>ADC_RESULT15</name>
          <displayName>ADC_RESULT15</displayName>
          <description>A/D Data Register 15</description>
          <addressOffset>0x3C</addressOffset>
       </register>
