cmsis-svd/cmsis-svd/data/Nuvoton/NANO100BN_v1.svd
       <register derivedFrom="GPIOA0">
          <name>GPIOB10</name>
          <displayName>GPIOB10</displayName>
          <description>GPIO Port B Bit 10 Data Register</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB11</name>
          <displayName>GPIOB11</displayName>
          <description>GPIO Port B Bit 11 Data Register</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB12</name>
          <displayName>GPIOB12</displayName>
          <description>GPIO Port B Bit 12 Data Register</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB13</name>
          <displayName>GPIOB13</displayName>
          <description>GPIO Port B Bit 13 Data Register</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB14</name>
          <displayName>GPIOB14</displayName>
          <description>GPIO Port B Bit 14 Data Register</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOB15</name>
          <displayName>GPIOB15</displayName>
          <description>GPIO Port B Bit 15 Data Register</description>
          <addressOffset>0x27C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC0</name>
          <displayName>GPIOC0</displayName>
          <description>GPIO Port C Bit 0 Data Register</description>
          <addressOffset>0x280</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC1</name>
          <displayName>GPIOC1</displayName>
          <description>GPIO Port C Bit 1 Data Register</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC2</name>
          <displayName>GPIOC2</displayName>
          <description>GPIO Port C Bit 2 Data Register</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC3</name>
          <displayName>GPIOC3</displayName>
          <description>GPIO Port C Bit 3 Data Register</description>
          <addressOffset>0x28C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC4</name>
          <displayName>GPIOC4</displayName>
          <description>GPIO Port C Bit 4 Data Register</description>
          <addressOffset>0x290</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC5</name>
          <displayName>GPIOC5</displayName>
          <description>GPIO Port C Bit 5 Data Register</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC6</name>
          <displayName>GPIOC6</displayName>
          <description>GPIO Port C Bit 6 Data Register</description>
          <addressOffset>0x298</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC7</name>
          <displayName>GPIOC7</displayName>
          <description>GPIO Port C Bit 7 Data Register</description>
          <addressOffset>0x29C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC8</name>
          <displayName>GPIOC8</displayName>
          <description>GPIO Port C Bit 8 Data Register</description>
          <addressOffset>0x2A0</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC9</name>
          <displayName>GPIOC9</displayName>
          <description>GPIO Port C Bit 9 Data Register</description>
          <addressOffset>0x2A4</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC10</name>
          <displayName>GPIOC10</displayName>
          <description>GPIO Port C Bit 10 Data Register</description>
          <addressOffset>0x2A8</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC11</name>
          <displayName>GPIOC11</displayName>
          <description>GPIO Port C Bit 11 Data Register</description>
          <addressOffset>0x2AC</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC12</name>
          <displayName>GPIOC12</displayName>
          <description>GPIO Port C Bit 12 Data Register</description>
          <addressOffset>0x2B0</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC13</name>
          <displayName>GPIOC13</displayName>
          <description>GPIO Port C Bit 13 Data Register</description>
          <addressOffset>0x2B4</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC14</name>
          <displayName>GPIOC14</displayName>
          <description>GPIO Port C Bit 14 Data Register</description>
          <addressOffset>0x2B8</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOC15</name>
          <displayName>GPIOC15</displayName>
          <description>GPIO Port C Bit 15 Data Register</description>
          <addressOffset>0x2BC</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD0</name>
          <displayName>GPIOD0</displayName>
          <description>GPIO Port D Bit 0 Data Register</description>
          <addressOffset>0x2C0</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOD1</name>
          <displayName>GPIOD1</displayName>
          <description>GPIO Port D Bit 1 Data Register</description>
          <addressOffset>0x2C4</addressOffset>
       </register>
