cmsis-svd/cmsis-svd/data/Nuvoton/NANO100BN_v1.svd
       <register derivedFrom="GPIOA0">
          <name>GPIOE10</name>
          <displayName>GPIOE10</displayName>
          <description>GPIO Port E Bit 10 Data Register</description>
          <addressOffset>0x328</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE11</name>
          <displayName>GPIOE11</displayName>
          <description>GPIO Port E Bit 11 Data Register</description>
          <addressOffset>0x32C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE12</name>
          <displayName>GPIOE12</displayName>
          <description>GPIO Port E Bit 12 Data Register</description>
          <addressOffset>0x330</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE13</name>
          <displayName>GPIOE13</displayName>
          <description>GPIO Port E Bit 13 Data Register</description>
          <addressOffset>0x334</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE14</name>
          <displayName>GPIOE14</displayName>
          <description>GPIO Port E Bit 14 Data Register</description>
          <addressOffset>0x338</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOE15</name>
          <displayName>GPIOE15</displayName>
          <description>GPIO Port E Bit 15 Data Register</description>
          <addressOffset>0x33C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOF0</name>
          <displayName>GPIOF0</displayName>
          <description>GPIO Port F Bit 0 Data Register</description>
          <addressOffset>0x340</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOF1</name>
          <displayName>GPIOF1</displayName>
          <description>GPIO Port F Bit 1 Data Register</description>
          <addressOffset>0x344</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOF2</name>
          <displayName>GPIOF2</displayName>
          <description>GPIO Port F Bit 2 Data Register</description>
          <addressOffset>0x348</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOF3</name>
          <displayName>GPIOF3</displayName>
          <description>GPIO Port A Bit 3 Data Register</description>
          <addressOffset>0x34C</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOF4</name>
          <displayName>GPIOF4</displayName>
          <description>GPIO Port F Bit 4 Data Register</description>
          <addressOffset>0x350</addressOffset>
       </register>
       <register derivedFrom="GPIOA0">
          <name>GPIOF5</name>
          <displayName>GPIOF5</displayName>
          <description>GPIO Port F Bit 5 Data Register</description>
          <addressOffset>0x354</addressOffset>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C0</name>
      <description>I2C Register Map</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40020000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>I2CCON</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I2CCON</displayName>
          <description>I2C Control Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPEN</name>
              <description>I2C Function Enable\nWhen this bit is set to 1, the I2C serial function is enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I2C function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I2C function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK</name>
              <description>Assert Acknowledge Control Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>: When this bit is set to 0 prior to address or data received, a Not acknowledged (high level to SDA) will be returned during the acknowledge clock pulse</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>When this bit is set to 1 prior to address or data received, an acknowledged will be returned during the acknowledge clock pulse on the SCL line when</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>I2C STOP Control Bit. \nIn Master mode, set this bit to 1 to transmit a STOP condition to bus then the controller will check the bus condition if a STOP condition is detected and this bit will be cleared by hardware automatically.\nIn Slave mode, set this bit to 1 to reset the controller to the defined "not addressed" Slave mode. This means it is NO LONGER in the slave receiver mode to receive data from the master transmit device.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Will be cleared by hardware automatically if a STOP condition is detected</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sends a STOP condition to bus in Master mode or reset the controller to "not addressed" in Slave mode</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>I2C START Command\nSetting this bit to 1 to enter Master mode, the device sends a START or repeat START condition to bus when the bus is free and it will be cleared to 0 after the START command is active and the STATUS has been updated.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>After START or repeat START is active</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Sends a START or repeat START condition to bus</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_STS</name>
              <description>I2C Status. \nWhen a new state is present in the I2CSTATUS register, this bit will be set automatically, and if the INTEN bit is set, the I2C interrupt is requested. It must be cleared by software by writing one to this bit and the I2C protocol function will go ahead until the STOP is active or the IPEN is disabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I2C's Status disabled and the I2C protocol function will go ahead</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I2C's Status active</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEN</name>
              <description>Interrupt Enable. </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I2C interrupt Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I2C interrupt Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I2CINTSTS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I2CINTSTS</displayName>
          <description>I2C Interrupt Status Register</description>
          <addressOffset>0x4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTSTS</name>
              <description>I2S STATUS's Interrupt Status\nWhen a new state is present in the I2CSTATUS register, this bit will be set automatically, and if INTEN bit is set, the I2C interrupt is requested. Software can write one to cleat this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIF</name>
              <description>Time-out Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>No Time-out flag. Software can cleat this flag</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Time-Out flag active and it is set by hardware.</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I2CSTATUS</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I2CSTATUS</displayName>
          <description>I2C Status Register</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <resetValue>0x000000F8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUS</name>
              <description>I2C Status Register\nIn addition, states 00H stands for a 'Bus Error'. A 'Bus Error' occurs when a START or STOP condition is present at an illegal position in the formation frame. Example of illegal position: a data byte or an acknowledge bit is present during the serial transfer of an address byte. \nTo recover I2C from bus error, STOP should be set and I2C_STS should be cleared to enter not addressed Slave mode. Then clear STOP to release the bus and to wait new communication. I2C bus can not recognize stop condition during this action when bus error occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I2CDIV</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I2CDIV</displayName>
          <description>I2C clock divided Register</description>
          <addressOffset>0xC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_DIV</name>
              <description>I2C Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I2CTOUT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I2CTOUT</displayName>
          <description>I2C Time-out control Register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOUTEN</name>
              <description>Time-out Counter Enable/Disable\nWhen set this bit to enable, the 14 bits time-out counter will start counting when STAINTSTS is cleared. Setting flag STAINTSTS to high or the falling edge of I2C clock or stop signal will reset counter and re-start up counting after STAINTSTS is cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV4</name>
              <description>Time-Out Counter Input Clock Divider by 4 \nWhen this bit is set enabled, the Time-Out period is prolonging 4 times.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I2CDATA</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I2CDATA</displayName>
          <description>I2C DATA Register</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>I2C Data Register\nThe DATA contains a byte of serial data to be transmitted or a byte which has just been received. The user can read from or write to this 8-bit I2CDATA register directly while it is not in the process of shifting a byte. This occurs when the serial interrupt flag is set. Data in DATA remains stable as long as I2C_STS bit is set. While data is being shifted out, data on the bus is simultaneously being shifted in; The DATA always contains the last data byte present on the bus. Thus, in the event of arbitration lost, the transition from master transmitter to slave receiver is made with the correct data in DATA.\nDATA and the acknowledge bit form a 9-bit shift register, the acknowledge bit is controlled by the device hardware and cannot be accessed by the user. Serial data is shifted through the acknowledge bit into DATA on the rising edges of serial clock pulses on the SCL line. When a byte has been shifted into DATA, the serial data is available in DATA, and the acknowledge bit (ACK or NACK) is returned by the control logic during the ninth clock pulse.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>I2CSADDR0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I2CSADDR0</displayName>
          <description>I2C Slave address Register0</description>
          <addressOffset>0x18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GCALL</name>
              <description>General Call Function \nThe I2C controller supports the "General Call" function. If the GCALL bit is set, the controller will respond to General Call address (00H). When GCALL bit is set, the controller is in Slave mode, it can receive the general call address by 00H after Master send general call address to the I2C bus, then it will follow status of GCALL mode. If it is in Master mode, the ACK bit must be cleared when it will send general call address of 00H to I2C bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>General Call Function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>General Call Function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SADDR</name>
              <description>I2C Salve Address Register\nThe content of this register is irrelevant when the device is in Master mode. In the Slave mode, the seven most significant bits must be loaded with the device's own address. The device will react if either of the address is matched.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="I2CSADDR0">
          <name>I2CSADDR1</name>
          <displayName>I2CSADDR1</displayName>
          <description>I2C Slave address Register1</description>
          <addressOffset>0x1C</addressOffset>
       </register>
       <register>
          <name>I2CSAMASK0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>I2CSAMASK0</displayName>
          <description>I2C Slave address Mask Register0</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUPEN</name>
              <description>I2C Wake-up Function Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>I2C wake-up function Disabled</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>I2C wake-up function Enabled</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMASK</name>
              <description>I2C Slave Address Mask Register\nI2C bus controllers support multiple address recognition with two address mask registers. When the bit in the address mask register is set to b'1, it means the received corresponding address bit is don't-care. If the bit is set to b'0, that means the received corresponding register bit should be exact the same as address register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Mask disable (the received corresponding register bit should be exact the same as address register.)</description>
                    <value>0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Mask enable (the received corresponding address bit is don't care.)</description>
                    <value>1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
